---
kind: property
id: P:Autodesk.Revit.DB.ColumnAttachment.BaseOrTop
source: html/39b18609-dfb3-8d9b-7968-049d34650720.htm
---
# Autodesk.Revit.DB.ColumnAttachment.BaseOrTop Property

Identifies if this ColumnAttachment is at the base or top of the column.

## Syntax (C#)
```csharp
public int BaseOrTop { get; }
```